<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--last modified on Tuesday, July 20, 1999 11:36 AM -->
<HTML><!-- #BeginTemplate "/Templates/Pagina Base.dwt" -->

<HEAD>
<META NAME="Author" Content="Francesco Giordano">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1">
<!-- #BeginEditable "doctitle" --> 
<TITLE>Ranma 1/2 What's New</TITLE>
<!-- #EndEditable --> 
<STYLE TYPE="TEXT/CSS">
<!--
body {  font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 9pt; color: #1010A8}
.menu {  font-family: Tahoma, Arial, Helvetica, sans-serif; font-size: 8pt; font-weight: bold; color: #E00000; position: relative; clip:   rect( -10px  )}
.testogenerico { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 10pt; color: #1010A8 }
.testoMenu { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 8pt; color: #1010A8 }
.nota {  font-family: Tahoma, Arial, Helvetica, sans-serif; font-size: 8pt; color: #1010A8}
a { font-family: Tahoma, Arial, Helvetica, sans-serif; font-size: 8pt; font-weight: bold; color: #E00000; position: relative; clip: rect( -10px ) ; font-style: normal; text-decoration: none}
a:hover {  color: #0010A8; text-decoration: underline}
.TitoloPag {  font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 16pt; font-weight: bold; color: #1010A8; background-color: #CCFFCC; background-position: right}
.Capoverso { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 12pt; color: #1010A8 ; font-style: italic; font-weight: bold; background-color: #D0FFD0; left: 10px; clip:  rect(   ); text-indent: 15pt}
.Titolo2 { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 14pt; font-weight: bold; color: #1010A8; background-color: #CCFFCC ; font-style: italic; text-indent: 10pt}
.Titolo3 { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 12pt; font-weight: bold; color: #1010A8; font-style: italic; text-indent: 10pt }
.Titolo4 { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 10pt; font-weight: normal; color: #C8FFC8; background-color: #1010A8; font-style: normal; text-indent: 10pt }
.NewBody { font-family: Verdana, Arial, Helvetica, sans-serif; font-size: 9pt; color: #1010A8 }
-->
</STYLE>
</HEAD>

<BODY TEXT="#0000AA" BGCOLOR="#FFFFFF" LINK="#FF0000" VLINK="#FF9999" ALINK="#FF0000">
<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%" HEIGHT="95">
  <TR ALIGN="RIGHT"> 
    <TD VALIGN="BOTTOM" HEIGHT="73"> 
      <DIV ALIGN="RIGHT"><!-- #BeginEditable "TitoloPag" --> 
        <P CLASS="TitoloPag" ALIGN="LEFT">What's New &amp; ToDo List</P>
        <!-- #EndEditable --></DIV>
    </TD>
  </TR>
  <TR> 
    <TD HEIGHT="5" BGCOLOR="#0000DD"><IMG SRC="spacer.gif" WIDTH="20" HEIGHT="5" ALIGN="BOTTOM" BORDER="0"></TD>
  </TR>
</TABLE>
<!-- #BeginEditable "CorpoPagina" --> 
<CENTER>
  <P>&nbsp; 
  <table width="90%" border="0" cellspacing="0" cellpadding="0" bgcolor="#CCFFCC">
    <tr> 
      <td> 
        <div align="center"> 
          <p><span class="nota"><b>Benvenuto</b>, Ospite numero<br>
            <font color="#0000DD">[<img src="http://visit.geocities.com/counter.gif" align="absmiddle">]<br>
            </font></span><span class="nota">questo sito &egrave; il mio piccolo 
            e personale tributo a <font color="#E00000">Ranma Saotome</font> e 
            <font color="#E00000">Akane Tendo</font>, perch&eacute; li considero 
            la coppia pi&ugrave; bella, pi&ugrave; simpatica, pi&ugrave; singolare, 
            pi&ugrave; azzeccata e pi&ugrave; &quot;tutto&quot; della storia del 
            fumetto e dell'animazione e perch&eacute; penso che, in fondo, il 
            loro sia un grande amore. Insomma...<br>
            <i><b>Benvenuto nel </b></i><font color="#E00000"><i><b>Mondo di Ranma 
            e Akane!!!</b></i></font></span> 
        </div>
      </td>
    </tr>
  </table>
  <P ALIGN="CENTER"><i>Registratevi usando il form qui sotto: riceverete un'email 
    ogni volta che questo sito viene aggiornato:</i></P>
  <TABLE BORDER="0" CELLPADDING="5" CELLSPACING="0">
    <TR> 
      <TD ALIGN="CENTER" COLSPAN="2" BGCOLOR="#CCFFCC" HEIGHT="40"> <FONT COLOR="#0000AA"><SPAN CLASS="testogenerico"><SPAN CLASS="testogenerico"><SPAN CLASS="testogenerico"><SPAN CLASS="nota"><SPAN CLASS="nota"><SPAN CLASS="nota"><SPAN CLASS="testogenerico"><SPAN CLASS="nota"><SPAN CLASS="testogenerico"><SPAN CLASS="nota">Ricevete 
        una email, quando queste Pagine Cambiano:</SPAN></SPAN></SPAN></SPAN></SPAN></SPAN></SPAN></SPAN></SPAN></SPAN></FONT> 
      </TD>
    </TR>
    <TR> 
      <TD ALIGN="CENTER" VALIGN="BOTTOM" BGCOLOR="#0000DD"> 
        <CENTER>
          <P> 
            <INPUT TYPE="TEXT" NAME="EMAIL" SIZE="20" VALUE="La vostra email...">
            <BR>
            <FONT SIZE="1" COLOR="#FFFFFF" FACE="arial,helvetica">_<B> Powered 
            by </B></FONT><A HREF="http://www.netmind.com"><FONT
						SIZE="1" FACE="arial,helvetica"><B>NetMind</B></FONT></A><FONT SIZE="1" COLOR="#FFFFFF" FACE="arial,helvetica"><B> 
            </B>_</FONT> 
        </CENTER>
      </TD>
      <TD ALIGN="CENTER" BGCOLOR="#0000DD"> 
        <CENTER>
          <P> 
            <INPUT TYPE="IMAGE" SRC="http://www.netmind.com/html/mindit.gif" WIDTH="76" HEIGHT="26" ALIGN="BOTTOM" BORDER="0" NAME="IMAGE">
            <INPUT TYPE="HIDDEN" NAME="REDIRECT" SIZE="-1" VALUE="http://www.geocities.com/Tokyo/Flats/1896/thanku.htm">
            <FONT SIZE="1" COLOR="#FFFFFF" FACE="arial,helvetica"><B>Click Here</B></FONT> 
        </CENTER>
      </TD>
    </TR>
  </TABLE>
  <P CLASS="testogenerico"><A HREF="#news">&gt;&gt;&gt;What's New</A> | <A HREF="#todo">ToDo 
    List&lt;&lt;&lt;</A></P>
</CENTER>
<P CLASS="Titolo2">What's New?<A NAME="news"></A> 
<P><SPAN CLASS="Capoverso">I</SPAN>nnanzitutto, qualche nota sul contenuto del 
  sito: come noterete leggendo le varie pagine, alcune sono pagine scritte da 
  me, e altre sono traduzioni di pagine di altri autori, sempre dietro permesso 
  degli autori originali, con l'intento di raccogliere quanto pi&ugrave; materiale 
  possibile in un unico &quot;luogo&quot;. Questo perch&eacute; credo che non 
  tutti hanno la voglia di leggere altre lingue o di navigare all'infinito (e 
  spesso a vuoto) sulla rete! Spero che questo sar&agrave; utile a qualcuno! Comunque, 
  anche nelle pagine tradotte, si trovano commenti o aggiunte fatti da me, quindi 
  anche chi naviga molto su internet, trover&agrave; sempre qualche cosa di inedito 
  e personale! Cercher&ograve; di aggiornare queste pagine pi&ugrave; spesso possibile... 
  tempo permettendo! Accetto consigli da chiunque ne abbia: scrivetemi a <A HREF="mailto:inuyaksa@geocities.com?subject=%5BRanma%20to%20Akane%5D">questo 
  indirizzo</A>. 
<p class="Titolo3">7 febbraio 2002 
<UL>
  <LI>ARGH! Dopo un bel po' di tempo mi sono accorto di una cosa inquietante: 
    non avevo messo online la nuova versione delle pagine che descrivono le censure!! 
    <B>Che baka!</B> :-D Ho sistemato la cosa, ora cliccando sul numero dell'episodio 
    (di alcuni episodi, non tutti) &egrave; possibile visualizzare le censure 
    effettuate nello stesso. Tutto ci&ograve; nella <A HREF="tvserie.html">pagina 
    sulla Serie TV</A>.</LI>
  <LI>Ho sistemato anche la <A HREF="webrings.html">pagina dei Links</A> che aveva 
    dei problemini: i links si aprivano nel frame.</LI>
</UL>
<p class="Titolo3">4 agosto 2001 
<ul>
  <li><b>YEAH!</b> (e anche Yatta! :D) Finalmente, dopo pi&ugrave; di un anno, 
    ho trovato il tempo di rimettere mano al mio piccolo situccio ^_^; Gomennasai 
    *inchin* ho passato un anno densissimo di cose. Ma veniamo subito al sodo:</li>
  <li>Ho modificato la pagina iniziale semplificandola e rendendola quindi anche 
    pi&ugrave; veloce da caricare (oltre che pi&ugrave; gradevole, IMHO). A causa 
    di questa modifica, alcune cose sono cambiate anche nel layout di questa pagina 
    e del men&ugrave; a sinistra.</li>
  <li>Ho modificato anche la <a href="chars_main.html">pagina dei personaggi</a>, 
    suddividendola in pi&ugrave; pagine organizzate in base alle famiglie o al 
    &quot;gruppo&quot; di appartenenza. Anche questa modifica, oltre a rendere 
    il tutto pi&ugrave; logico e coerente, aiuta la velocit&agrave; di caricamento 
    che prima era abbastanza penosa ^^;</li>
</ul>
<P class="Titolo3">22 maggio 2000 
<ul>
  <li>Non ho fatto modifiche sul contenuto del sito, ma soltanto sul codice html. 
    (Sembra proprio che involontariamente abbia scoperto un bug di Netscape Navigator 
    - anche nelle versioni pi&ugrave; recenti come la 6beta - che ho segnalato 
    anche alla Netscape). </li>
</ul>
<P> 
<P CLASS="Titolo3">27 gennaio 2000</P>
<UL>
  <LI>la novit&agrave; pi&ugrave; evidente &egrave; il cambio di look&amp;feel 
    di tutto il sito: non solo ho modificato sostanzialmente l'aspetto delle pagine, 
    ma ho modificato anche la modalit&agrave; di navigazione che ora &egrave; 
    decisamente pi&ugrave; immediata. Avendo l'acqua un ruolo fondamentale in 
    tutta la storia di Ranma, ho pensato di dare, un &quot;look un po' acquatico&quot; 
    anche nei colori al sito: spero vivamente che piaccia. Ho azzerato le news 
    pi&ugrave; vecchie ma, per vedere come cambia la storia del sito, ho lasciato 
    alcuni riferimenti ad esse: <B>&egrave; bello vedere un figlio che cresce</B> 
    ^____^ </LI>
  <LI>oltre a cambiare la forma, sto facendo una revisione globale anche dei contenuti. 
    Oramai c'erano delle informazioni obsolete per quanto riguarda le uscite ecc. 
    ed ho dovuto cambiarle. Ho anche integrato i testi preesistenti con nuove 
    osservazioni. Alcune delle sottopagine (i riassunti del manga e dei tagli 
    tv) ancora non hanno il nuovo look, li aggiorner&ograve; mano a mano</LI>
  <LI>ho aggiunto una <A HREF="search.html">nuova pagina</A> per effettuare delle 
    ricerche (non le solite ricerche sul web) sui testi contenuti nel sito: questa 
    cosa mi piace molto. Se, ad esempio, fate una ricerca della parola &quot;Akane&quot;, 
    vi verranno mostrate tutte le pagine contenenti il suo nome. Si possono fare 
    delle vere e proprie ricerche &quot;scolastiche&quot; ed enciclopediche su 
    vita morte e miracoli ad esempio dei personaggi e sapere, cos&igrave;, in 
    quali episodi apparivano. A me piace molto giocare con 'sta cosa! ^__^</LI>
  <LI>ho finalmente inaugurato la nuova <A HREF="tools.html">pagina &quot;Varie&quot;</A> 
    in cui raccoglier&ograve; qualche regalino simpatico da scaricare ed usare 
    sul vostro PC come i temi del desktop, file KISS, giochi per Win eccetera. 
    In particolare vi consiglio i due videogiochi che sono simpatici. Per ora 
    &egrave; ancora un po' scarna, ma cercher&ograve; di espanderla sempre di 
    pi&ugrave;.</LI>
  <LI>ho anche inaugurato il nuovo url, pi&ugrave; bello e semplice da ricordare: 
    <A HREF="http://nibunnoichi.cjb.net">http://nibunnoichi.cjb.net</A> </LI>
  <LI>ho dovuto aggiornare anche la pagina degli <A HREF="webrings.html">WebRings</A>, 
    alcuni erano ormai &quot;defunti&quot;, ne aggiunger&ograve; di nuovi</LI>
</UL>
<P CLASS="Titolo3">20 luglio 1999 </P>
<P></P>
<UL>
  <LI>ho finalmente inaugurato la <A HREF="faq_main.html">sezione F.A.Q.</A>, 
    con molte notizie interessanti: ovviamente &egrave; destinata a crescere sempre 
    di pi&ugrave; 
  <LI>ho anche attivato la possibilit&agrave; di essere avvisati via email, ogni 
    volta che queste pagine cambiano... 
</UL>
<P CLASS="Titolo3">7 ottobre 1998 
<P><SPAN CLASS="Capoverso">Q</SPAN>uesto &egrave; stato un aggiornamento abbastanza 
  &quot;massiccio&quot; in cui ho dato una bella tagliata alla ToDo List :-)) 
</P>
<UL>
  <LI> da oggi in poi, in questo elenco delle modifiche, metter&ograve; dei links 
    veloci alle parti interessate 
  <LI>finalmente, ho inserito la <A HREF="webrings.html">sezione Links</A>, con 
    un sacco di links interessanti, oltre ai WebRings pi&ugrave; belli 
  <LI>la <A HREF="misc.html">sezione Miscellanea</A>, ha cominciato a prendere 
    una forma ^__^ 
  <LI>ho inserito la <A HREF="rumik.html">biografia di Rumiko Takahashi</A>, con 
    accenni alle altre sue opere al di fuori di Ranma 
  <LI>ho finalmente aggiunto la <A HREF="videog.html">sezione sui Videogames</A> 
    di Ranma (ancora incompleta) con del materiale (immagini, roms per emulatori 
    ecc.) disponibile per essere scaricato 
</UL>
<P CLASS="Titolo3">9 settembre 1998 
<P></P>
<UL>
  <LI>ho voluto sperimentare una nuova impostazione per la pagina iniziale, ma 
    soltanto per quella. Il resto &egrave; rimasto uguale 
  <LI>per accelerare il tempo di caricamento della pagina iniziale, ho spostato 
    il codice relativo ai vari WrebRings in una nuova pagina apposita 
  <LI>ho pensato di mettere un collegamento con la pagina dei links che mantengo 
    su Dojinshi 
</UL>
<P><SPAN CLASS="Titolo3">24 febbraio 1998</SPAN> 
<UL>
  <LI>il <I>look&amp;feel</I> del sito &egrave; stato aggiornato (ormai dovreste 
    averlo capito ^__^) 
  <LI>questo sito &egrave; entrato a far parte di alcuni dei cosiddetti &quot;<I>Web 
    Ring</I>&quot; 
  <LI><FONT SIZE="5"></FONT>ho anche creato un &quot;Banner&quot; che ho sottomesso 
    alle varie &quot;associazioni&quot; del caso, e che quindi &quot;vagher&agrave;&quot; 
    in giro per la Rete 
  <LI>dal momento che sono un italiano e questo sito &egrave; rivolto agli italiani, 
    ho modificato tutte le pagine in modo da usare le vocali accentate che mi 
    piacciono di pi&ugrave; rispetto a vocale+apostrofo 
  <LI>i riassunti dei volumi del manga, ora arrivano fino al Volume 9; purtroppo 
    questa &egrave; per me la parte pi&ugrave; difficile, dato che devo controllare 
    con i volumi originali, con quelli italiani, correggere ecc...insomma ci metto 
    un sacco di tempo! ^_^ 
</UL>
<P><B>17-12-1997</B></P>
<P><B>27-10-1997</B> Questo &egrave; stato il &quot;battesimo&quot; di questo 
  sito... eeehhh come passa il tempo ;____;;;</P>
<P CLASS="Titolo2">ToDo List<A NAME="todo"></A></P>
<P> <SPAN CLASS="Capoverso">Q</SPAN>uello che troverete nelle prossime versioni. 
  (In ordine sparso e non di priorit&agrave;) 
<UL>
  <LI>il Completamento della Lista Manga 
  <LI>il Completamento della Lista Episodi TV 
  <LI>il Completamento della Lista Lungometraggi e OAVs 
  <LI>vorrei inserire, mano a mano, le sinossi degli episodi TV, Manga, Film, 
    OAV ecc. (il mio obiettivo sarebbe di metterle TUTTE!) 
  <LI>descrizione di ulteriori Personaggi Secondari 
  <LI>immagini, Suoni, Video, Bombe a Mano e Tricchettracche! 
  <LI>il Supporto a <I>Shodouka </I>o qualche altro modo di visualizzare i Caratteri 
    Giapponesi 
  <LI>un'idea da matto (di quelle che solo il vero otaku pu&ograve; avere ^__^) 
    che mi &egrave; venuta, &egrave; che vorrei fare la ricostruzione del Dojo 
    Tendo, visitabile in VRML. Ma questo &egrave; un progetto molto lontano, perch&eacute; 
    mi porter&agrave; via tantissimo tempo 
  <LI>varie ed Eventuali! 
</UL>
<P></P>
<P> 
<!-- #EndEditable --> 
<CENTER></CENTER>
<P>
<TABLE BORDER="0" CELLPADDING="0" CELLSPACING="0" WIDTH="100%">
  <TR> 
    <TD WIDTH="100%" HEIGHT="5" BGCOLOR="#0000DD"><IMG SRC="spacer.gif" WIDTH="20" HEIGHT="5" ALIGN="BOTTOM" BORDER="0"></TD>
  </TR>
  <TR> 
    <TD WIDTH="100%" BGCOLOR="#CCFFCC" class="nota">Grafica, impaginazione e testi 
      sono (c) di <a href="mailto:inuyaksa@geocities.com">Francesco &quot;Nibunnoichi&quot; 
      Giordano</a> e non possono essere usati senza il consenso dell'autore.</TD>
  </TR>
</TABLE>



<P ALIGN="CENTER"><!--#geoguide--></P>
</BODY>

<!-- #EndTemplate --></HTML>